/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec - extensão";
"06 06 02 82 06 01 0A 01"		= "Telesec - mecanismo";

"06 07 02 82 06 01 0A 01 00"	= "Autenticação Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Autenticação de palavra-passe";
"06 08 02 82 06 01 0A 01 00 02" = "Autenticação por palavra-passe protegida";
"06 08 02 82 06 01 0A 01 00 03" = "Autenticação X.509 uni-direccional";
"06 08 02 82 06 01 0A 01 00 04" = "Autenticação X.509 bidireccional";
"06 08 02 82 06 01 0A 01 00 05" = "Autenticação X.509 tridireccional";
"06 08 02 82 06 01 0A 01 00 06" = "Autenticação ISO9798 uni-direccional";
"06 08 02 82 06 01 0A 01 00 07" = "Autenticação ISO9798 bidireccional";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom - autenticação";

"06 07 02 82 06 01 0A 01 01"	= "Telesec - assinatura";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 com RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 com RSA e assinatura Telesec padrão";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 com RSA e ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 com RSA e assinatura Telesec padrão";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 com RSA e assinatura Telekom padrão";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI - assinatura RSA";

"06 07 02 82 06 01 0A 01 02"	= "Telesec - cifragem";
"06 08 02 82 06 01 0A 01 02 00"	= "nada";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Função uni-direccional";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash através de cifra de bloqueio";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Função FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec - módulo";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmos";
"06 07 02 82 06 01 0A 02 01"	= "Tipos de atributo";
"06 07 02 82 06 01 0A 02 02"	= "Tipos de certificado";
"06 07 02 82 06 01 0A 02 03"	= "Tipos de mensagem";
"06 07 02 82 06 01 0A 02 04"	= "Protocolo PL";
"06 07 02 82 06 01 0A 02 05"	= "SME e componentes de SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definições úteis";
"06 07 02 82 06 01 0A 02 08"	= "Ficheiros STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Encomenda electrónica";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec - aplicação assimétrica TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec - aplicação de base TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec - mensagens TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec - aplicação de marcação de hora TTP";

"06 06 02 82 06 01 0A 03"		= "Classe de objecto";
"06 07 02 82 06 01 0A 03 00"	= "Telesec - outro nome";
"06 07 02 82 06 01 0A 03 01"	= "Directório";
"06 07 02 82 06 01 0A 03 02"	= "Tipo de directório";
"06 07 02 82 06 01 0A 03 03"	= "Grupo de directórios";
"06 07 02 82 06 01 0A 03 04"	= "Utilizador de directório";
"06 07 02 82 06 01 0A 03 05"	= "Entrada de chave simétrica";

"06 06 02 82 06 01 0A 04"		= "Pacote";
"06 06 02 82 06 01 0A 05"		= "Parâmetro";
"06 06 02 82 06 01 0A 06"		= "União de nomes";
"06 06 02 82 06 01 0A 07"		= "Atributo";
"06 07 02 82 06 01 0A 07 00"	= "Identificador de grupo de inscrição";
"06 07 02 82 06 01 0A 07 01"	= "Tipo de certificado";
"06 07 02 82 06 01 0A 07 02"	= "Telesec - certificado";
"06 07 02 82 06 01 0A 07 03"	= "Número de certificado";
"06 07 02 82 06 01 0A 07 04"	= "Lista de revogação de certificados";
"06 07 02 82 06 01 0A 07 05"	= "Data de criação";
"06 07 02 82 06 01 0A 07 06"	= "Emissor";
"06 07 02 82 06 01 0A 07 07"	= "Autoridade de nomenclatura";
"06 07 02 82 06 01 0A 07 08"	= "Lista de chaves públicas";
"06 07 02 82 06 01 0A 07 09"	= "Domínio de segurança";
"06 07 02 82 06 01 0A 07 0A"	= "Sujeito";
"06 07 02 82 06 01 0A 07 0B"	= "Hora de revogação";
"06 07 02 82 06 01 0A 07 0C"	= "Referência de grupo de utilizadores";
"06 07 02 82 06 01 0A 07 0D"	= "Validade";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Ambiente de mensagem de segurança";
"06 07 02 82 06 01 0A 07 10"	= "Lista anónima de chaves públicas ";
"06 07 02 82 06 01 0A 07 11"	= "Telesec - nome próprio";
"06 07 02 82 06 01 0A 07 12"	= "Outros nomes";
"06 07 02 82 06 01 0A 07 13"	= "Telesec - código postal";
"06 07 02 82 06 01 0A 07 14"	= "Distinção de nome";
"06 07 02 82 06 01 0A 07 15"	= "Telesec - lista de certificados";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust - lista de certificados";
"06 07 02 82 06 01 0A 07 17"	= "Lista de certificados X.509";
"06 07 02 82 06 01 0A 07 18"	= "Hora de emissão";
"06 07 02 82 06 01 0A 07 19"	= "Número de cartão físico";
"06 07 02 82 06 01 0A 07 1A"	= "Tipo de ficheiro";
"06 07 02 82 06 01 0A 07 1B"	= "Ficheiro Ctl é arquivo";
"06 07 02 82 06 01 0A 07 1C"	= "Endereço de e-mail";
"06 07 02 82 06 01 0A 07 1D"	= "Lista de modelos de certificado";
"06 07 02 82 06 01 0A 07 1E"	= "Directório";
"06 07 02 82 06 01 0A 07 1F"	= "Tipo de directório";
"06 07 02 82 06 01 0A 07 20"	= "Grupo de directórios";
"06 07 02 82 06 01 0A 07 21"	= "Utilizador de directório";
"06 07 02 82 06 01 0A 07 22"	= "Indicador de revogação";
"06 07 02 82 06 01 0A 07 23"	= "Entrada de chave simétrica";
"06 07 02 82 06 01 0A 07 24"	= "Número GL";
"06 07 02 82 06 01 0A 07 25"	= "Número GO";
"06 07 02 82 06 01 0A 07 26"	= "Dados de chave G";
"06 07 02 82 06 01 0A 07 27"	= "Dados de chave Z";
"06 07 02 82 06 01 0A 07 28"	= "Dados chave KT";
"06 07 02 82 06 01 0A 07 2A"	= "Número de chave KT";
"06 07 02 82 06 01 0A 07 33"	= "Geração de hora de revogação";
"06 07 02 82 06 01 0A 07 34"	= "Texto de responsabilidade legal";

"06 06 02 82 06 01 0A 08"		= "Grupo de atributos";
"06 06 02 82 06 01 0A 09"		= "Acção";
"06 06 02 82 06 01 0A 0A"		= "Notificação";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplicação de segurança";

"06 06 02 82 06 01 0A 0C"		= "Definições de extensão de certificado e CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Extensão de limitação de responsabilidade de extensão de certificado";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec - extensão de id de certificados";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec - identificador de política";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec - identificador de qualificador de política";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec - extensão filtrada de CRL";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec - extensão de filtro de CRL";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec - extensão de autoridade de nomenclatura";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID de utilizador";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 - caixa de correio";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Componente de domínio";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Austrália - número de identificação comercial";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificates Australia - identificador de política";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet - pessoal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet - empresarial";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet - legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet - piloto";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet - IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet - identificador de política";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritmo de cifragem simétrica";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS High-Assurance - identificador de política";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK - identificador de política";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT - identificador pessoal";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Módulo X9.57 ANSI";
"06 07 2A 86 48 CE 38 01 01"	= "Gestão de certificados X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instrução de suspensão";
"06 07 2A 86 48 CE 38 02 01"	= "Instrução de suspensão - nehuma";
"06 07 2A 86 48 CE 38 02 02"	= "Contactar emissor";
"06 07 2A 86 48 CE 38 02 03"	= "Rejeitar";
"06 07 2A 86 48 CE 38 02 04"	= "Recolha do token";
"06 06 2A 86 48 CE 38 03"		= "Atributo";
"06 06 2A 86 48 CE 38 03 01"	= "Segunda assinatura";
"06 06 2A 86 48 CE 38 03 02"	= "Certificado de atributos";
"06 06 2A 86 48 CE 38 04"		= "Algoritmo";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA - concordância";
"06 07 2A 86 48 CE 38 04 03"	= "DSA com SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Tipo de campo ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Campo principal";
"06 07 2A 86 48 CE 3D 01 02"	= "Campo característica-dois";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Base característica-dois";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Base nula";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Base trinominal";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Base pentanominal";
"06 06 2A 86 48 CE 3D 02"		= "Tipo de chave pública";
"06 07 2A 86 48 CE 3D 02 01"	= "Chave pública de curva elíptica";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Tipo de campo ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Campo principal de Galois";
"06 06 2A 86 48 CE 3E 02"		= "Tipo de número";
"06 07 2A 86 48 CE 3E 02 01"	= "Chave pública Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Esquema";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman estático";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman efémero";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman híbrido 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman híbrido 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust - versão";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE com MD5 e CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC baseado em palavra-passe";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust - utilizador";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust - informação de CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certificado de atributos";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP - cifragem (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP - cifragem";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP - especificado por etiqueta";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Esquema de assinatura RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 com cifragem RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 com cifragem RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Cifragem BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Acordo de chaves Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE com MD2 e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE com MD5 e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE com MD2 e RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE com MD5 e RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE com MD5 e XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE com SHA e DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dados";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Dados assinados";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Dados protegidos";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Dados assinados e protegidos";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Dados sintetizados";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Dados cifrados";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dados com atributos";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informação de chave privada cifrada";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Endereço de e-mail";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nome não estruturado";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Tipo de conteúdo";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Síntese de mensagem";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Data e hora de assinatura";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Segunda assinatura";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Confirmar palavra-passe";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Endereço não estruturado";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atributos de certificado ampliados";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Emissor e número de série";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Confirmação de palavra-passe";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Chave pública";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Descrição de assinatura";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Pedido de extensão";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME - capacidades";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferir dados assinados";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Não é possível decifrar nenhum";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Pedido de recibo";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Recibo";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Dicas de conteúdo";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Histórico de expansão da lista de correio";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME - módulos";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaxe de mensagem criptográfica";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Serviços de segurança melhorados";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME - identificador de objecto";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Mensagem S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS - assinatura electrónica 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS - assinatura electrónica 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS - política de assinatura electrónica 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS - política de assinatura electrónica 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME - tipos de conteúdo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME - atributos autenticados";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME - algoritmos";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME - distribuição de certificados";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Distribuição de certificados LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME - qualificador de política de assinatura";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME - identificador de tipo assinatura";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Assinatura do criador";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Assinatura de domínio";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Assinatura de atributos adicionais";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Rever assinatura";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME - capacidades";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferir binário interno";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nome descritivo (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Identificador de chave local (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Tipos de certificado (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certificado X.509 (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certificado SDSI (para PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Tipos de CRL (para PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "CRL X.509 (para PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 - sintaxe de troca de informação pessoal";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 - identificadores com cifragem baseada em palavra‑passe";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE com SHA-1 e RC4 de 128-Bit";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE com SHA-1 e RC4 de 40-Bit";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE com SHA-1 e DES-CBC triplo de 3 chaves";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE com SHA-1 e DES-CBC triplo de 2 chaves";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE com SHA-1 e RC2-CBC de 128-Bit";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE com SHA-1 e RC2-CBC de 40-Bit";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 - identificadores ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 - protecção de chaves";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 - identificadores bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 - bag id de chaves";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 - certificado e bag id de CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 - bag id secreto";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 - id de conteúdo seguro";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 - bag id de chaves protegidas";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 - bag id de certificados";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 - certificado X.509 e bag id de CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 - bag id de certificados de SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 - OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 - identificador com cifragem baseada em palavra‑passe";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 - PBE com SHA-1 e RC4 de 128-Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 - PBE com SHA-1 e RC4 de 40-Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 - PBE com SHA-1 e DES-CBC triplo";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 - PBE com SHA-1 e RC2-CBC de 128-Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 - PBE com SHA-1 e RC2-CBC de 40-Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 - PBE com SHA-1 e RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 - PBE com SHA-1 e RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 - identificadores de protecção";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 - cifragem RSA com RC4 de 128-Bits";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 - cifragem RSA com RC4 de 40-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 - cifragem RSA com DES triplo";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 - id de assinatura";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Assinatura PKCS-12 RSA com síntese SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 versão 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 - identificadores bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 - bag de chaves";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 - bag de chaves protegidas";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 - bag de certificados";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 - bag de CRL";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 - bag secreto";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 - bag de conteúdo seguro";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 - módulos";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 - atributos";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 - tipo de conteúdo";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 - conteúdo";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI - algoritmo de síntese";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC com SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI - algoritmo de cifragem";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 com MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Teclado RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus - identificador de política desconhecido";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus - OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange - classe de objecto do servidor";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Endereçamento de site";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Esquema de classe";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Esquema de atributos";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agente da caixa de correio";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Caixa de correio";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Contentor";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Destinatário";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mecanismo de entrega";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft - formatos de ficheiro";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Código de autenticação";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC - contexto de dados indirectos";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC - informação de agência";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC - tipo de declaração";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC - informação Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC - extensões de certificados";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC - dados de imagem PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC - hiperligação (tipo 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Assinatura de código individual";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Assinatura de código comercial";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC - hiperligação (tipo 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC - critérios mínimos";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC - critérios financeiros";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC - hiperligação (tipo 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM - fornecedor de apoio de segurança";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Segunda assinatura de marcação de hora";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Lista de confiança de certificados";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Extensão de CTL ordenada ";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Local de actualização seguinte";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Utilização de chaves melhorada";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Assinatura de lista de confiança de certificados";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Assinatura de marcação de hora";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Cifragem em série";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistemas de ficheiros cifrados";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Recuperação de sistemas de ficheiros cifrados";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Compatível com hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 - assinatura";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Assinatura OEM de hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Assinatura NT incorporada";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Assinatura de lista raiz segura";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordinação qualificada";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Recuperação de chaves";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Assinatura de documento";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Identificadores de objecto de atributos";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atributo de confiança Sim/Não";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft - individualização de DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft - licenças";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft - servidor de licenças";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 - identificadores de objectos";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certificado de renovação";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Nome de registo/Par de valores";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP de registo";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versão do SO";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 - atributos";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Conjunto de chaves da máquina local";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft - infra-estrutura de registo";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Uso de CTL de registo automático";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Tipo de certificado de registo";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agente de registo";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Acesso por smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nome principal de NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft - infra-estrutura de servidor de certificados";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft - versão de renovação da CA";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versão CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atributo CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nome de documento";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Descrição de documento";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Dados cifrados";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Conteúdo cifrado";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT - identificador de política";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL - identificador de política";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA - identificador de política";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal com SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal com RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atributos cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Verificação de presença cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP - RTCS resposta";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP - resposta RTCS ampliada";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Razão ampliada de CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Características da chave";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI - inicialização";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Conteúdo cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Dados de configuração cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Índice de utilizador cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Informação de utilizador cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY - identificador de política";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Sistema de assinatura temporal";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Sistema de assinatura temporal 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Sistema de assinatura temporal 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Sistema de assinatura temporal 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Práticas secundárias";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Identificadores de médicos";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos - PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos - dados de autenticação";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos - dados da chave Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos - dados de chave de resposta";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos - autenticação de cliente";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos - centro de distribuição de chaves (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Mecanismo de chave pública simples (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infra-estrutura de chave pública";

"06 07 2B 06 01 05 05 07 01"		= "PKIX - extensões de certificado privado";
"06 08 2B 06 01 05 05 07 01 01"		= "Acesso a informação da autoridade de certificação";
"06 08 2B 06 01 05 05 07 01 02"		= "Informação biométrica";
"06 08 2B 06 01 05 05 07 01 03"		= "Declarações de certificado qualificadas";
"06 08 2B 06 01 05 05 07 01 04"		= "Identidade de fiscalização de certificado de atributos";
"06 08 2B 06 01 05 05 07 01 05"		= "Alvo de certificado de atributos";
"06 08 2B 06 01 05 05 07 01 06"		= "Controlos de autoridade de certificado de atributos";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP - bloco de endereços IP";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP - identificador de sistema autónomo";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP - identificador de router";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxying de certificado de atributos";
"06 08 2B 06 01 05 05 07 01 0B"		= "Acesso a informação relativa ao sujeito";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logótipo";

"06 07 2B 06 01 05 05 07 02"		= "Tipos de qualificador de política";
"06 08 2B 06 01 05 05 07 02 01"		= "Declaração de práticas de certificação";
"06 08 2B 06 01 05 05 07 02 02"		= "Aviso ao utilizador";
"06 08 2B 06 01 05 05 07 02 03"		= "Aviso";

"06 07 2B 06 01 05 05 07 03"		= "Objectivo da chave";
"06 08 2B 06 01 05 05 07 03 01"		= "Autenticação de servidor";
"06 08 2B 06 01 05 05 07 03 02"		= "Autenticação de cliente";
"06 08 2B 06 01 05 05 07 03 03"		= "Assinatura de código";
"06 08 2B 06 01 05 05 07 03 04"		= "Protecção de e-mail";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC - sistema final";
"06 08 2B 06 01 05 05 07 03 06"		= "Túnel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC - utilizador";
"06 08 2B 06 01 05 05 07 03 08"		= "Marcação de hora";
"06 08 2B 06 01 05 05 07 03 09"		= "Assinatura OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP - autenticação de servidor AA";

"06 07 2B 06 01 05 05 07 04"		= "Tipos de informação CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certificado de cifragem do protocolo de CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Tipos de pares de chaves de assinatura";
"06 08 2B 06 01 05 05 07 04 03"		= "Tipos de pares de chaves de cifragem";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritmo simétrico preferido";
"06 08 2B 06 01 05 05 07 04 05"		= "Informação de actualização de chave CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL actual";
"06 08 2B 06 01 05 05 07 04 07"		= "OIDs não suportados";
"06 08 2B 06 01 05 05 07 04 08"		= "Pedido de assinatura de serviço";
"06 08 2B 06 01 05 05 07 04 09"		= "Resposta de assinatura de serviço";
"06 08 2B 06 01 05 05 07 04 0A"		= "Pedido de parâmetro de par de chaves";
"06 08 2B 06 01 05 05 07 04 0B"		= "Resposta de parâmetro de par de chaves";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registo CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Controlo de registo";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Token de registo";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autenticador";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI - informação";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI - opções de arquivo";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Identificador de certificado antigo";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Chave de cifragem de protocolo";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Modelo de certificado alternativo";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Modelo WTLS WAP";

"06 08 2B 06 01 05 05 07 05 02"		= "Informação de eegisto CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Pares UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Pedido de certificado";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmos";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Nenhuma assinatura";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Controlos CMC";

"06 07 2B 06 01 05 05 07 08"		= "Outros nomes";
"06 08 2B 06 01 05 05 07 08 01"		= "Dados pessoais";
"06 08 2B 06 01 05 05 07 08 02"		= "Grupo de utilizadores";

"06 07 2B 06 01 05 05 07 09"		= "Dados pessoais";
"06 08 2B 06 01 05 05 07 09 01"		= "Data de nascimento";
"06 08 2B 06 01 05 05 07 09 02"		= "Local de nascimento";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudónimo";
"06 08 2B 06 01 05 05 07 09 04"		= "Género";
"06 08 2B 06 01 05 05 07 09 05"		= "País de cidadania";
"06 08 2B 06 01 05 05 07 09 06"		= "País de residência";

"06 07 2B 06 01 05 05 07 0A"		= "Certificado de atributos";
"06 08 2B 06 01 05 05 07 0A 01"		= "Informação de autenticação";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identidade de acesso";
"06 08 2B 06 01 05 05 07 0A 03"		= "Identidade de cobrança";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grupo";
"06 08 2B 06 01 05 05 07 0A 05"		= "Cargo";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protocolo de estado de certificado online (OCSP)";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP - resposta básica";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP - extensão temporária";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP - referência CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP - resposta";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP - sem confirmação de revogação";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP - limite de arquivo";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP - localizador de serviços";

"06 08 2B 06 01 05 05 07 30 02"		= "Emissores de CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Marcação de hora";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE - intermediário";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritmo de cifragem DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritmo de hash de DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritmo de assinatura DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 com RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 com RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 com RSA";
"06 05 2B 0E 03 02 03"				= "MD5 com RSA";
"06 05 2B 0E 03 02 04"				= "MD4 com cifragem RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N com RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Assinatura RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA com SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 com assinatura RSA";
"06 05 2B 0E 03 02 0F"				= "SHA com assinatura RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman com Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA - comum";
"06 05 2B 0E 03 02 15"				= "DSA - comum com SHA";
"06 05 2B 0E 03 02 16"				= "Transporte de chave RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 com assinatura RSA";
"06 05 2B 0E 03 02 19"				= "MD5 com assinatura RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA com SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA com SHA-1 comum";
"06 05 2B 0E 03 02 1D"				= "SHA-1 com cifragem RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 com RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 com ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Documento";
"06 04 2B 24 01 01"					= "Versão final";
"06 04 2B 24 01 02"					= "Rascunho";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmo";
"06 04 2B 24 03 01"					= "Algoritmo de cifragem";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Teclado DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Teclado ISO DES-ECB";
"06 07 2B 24 03 01 01 02 01"		= "Teclado DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Teclado ISO DES-CBC";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "Teclado DES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "Teclado ISO DES3-ECB";
"06 07 2B 24 03 01 03 02 01"		= "Teclado DES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "Teclado ISO DES3-CBC";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Teclado IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Teclado ISO IDEA-ECB";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Teclado IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Teclado ISO IDEA-CBC";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Cifragem RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "Teclado BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "Teclado BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "Teclado BSI-1-CBC PEM";

"06 04 2B 24 03 02"					= "Algoritmo de hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 - comprimento único";
"06 05 2B 24 03 02 05"				= "MDC2 - comprimento duplo";
"06 04 2B 24 03 03"					= "Algoritmo de assinatura";
"06 05 2B 24 03 03 01"				= "Assinatura RSA";

"06 06 2B 24 03 03 01 01"			= "Assinatura RSA com SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Assinatura RSA com SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Assinatura RSA com SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Assinatura RSA com SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Assinatura RSA com SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Assinatura RSA com SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Assinatura RSA com SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Assinatura RSA com SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Assinatura RSA com SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Assinatura RSA com SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Assinatura RSA com SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Assinatura RSA com SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Assinatura RSA com SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Assinatura RSA com SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Assinatura RSA com SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Assinatura RSA com SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Assinatura RSA com SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Assinatura RSA com SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Assinatura RSA com SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Assinatura RSA com SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Assinatura RSA com SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Assinatura RSA com SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Assinatura RSA com SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Assinatura RSA com SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Assinatura RSA com SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Assinatura RSA com SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Assinatura RSA com RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Assinatura RSA com RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Assinatura RSA com RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Assinatura RSA com RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Assinatura RSA com RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Assinatura RSA com RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Assinatura RSA com RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Assinatura RSA com RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Assinatura RSA com RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Assinatura RSA com RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Assinatura RSA com RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Assinatura RSA com RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Assinatura RSA com RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Assinatura RSA com RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Assinatura RSA com RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Assinatura RSA com RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Assinatura RSA com RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Assinatura RSA com RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Assinatura RSA com RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Assinatura RSA com RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Assinatura RSA com RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Assinatura RSA com RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Assinatura RSA com RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Assinatura RSA com RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Assinatura RSA com RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Assinatura RSA com RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Assinatura RSA com RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Assinatura RSA com RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE - assinatura";
"06 06 2B 24 03 03 02 01"			= "ECSIE - assinatura com SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE - assinatura com RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE - assinatura com MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE - assinatura com MD5";

"06 04 2B 24 03 04"					= "Esquema de assinatura";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 com RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 com RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 com RND";

"06 03 2B 24 04"					= "Atributo";
"06 03 2B 24 05"					= "Política";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API de fabricante específico";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API de funcionalidade específica";
"06 03 2B 24 07"					= "Gestão de chaves";
"06 04 2B 24 07 01"					= "Acordo de chave";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Transferência de chaves";
"06 05 2B 24 07 02 01"				= "ISO9796-2 com cifragem RSA";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform - identificador de política";
"06 05 2B 24 08 02 01"				= "Serviço de directório";

"06 05 2B 24 08 03 01"				= "Data de geração do certificado";
"06 05 2B 24 08 03 02"				= "Aquisição";
"06 05 2B 24 08 03 03"				= "Admissão";
"06 05 2B 24 08 03 04"				= "Limite monetário";
"06 05 2B 24 08 03 05"				= "Declaração de maioria";
"06 05 2B 24 08 03 06"				= "Número de série de placa de circuitos integrados";
"06 05 2B 24 08 03 07"				= "Referência a chave pública";
"06 05 2B 24 08 03 08"				= "Restrição";
"06 05 2B 24 08 03 09"				= "Recuperar se permitido";
"06 05 2B 24 08 03 0A"				= "Certificado pedido";
"06 05 2B 24 08 03 0B"				= "Autoridades de nomenclatura";
"06 05 2B 24 08 03 0C"				= "Certificado na lista desde";
"06 05 2B 24 08 03 0D"				= "Certificado de hash";

"06 05 2B 24 08 04 01"				= "Dados pessoais";
"06 05 2B 24 08 04 08"				= "Restrição";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA com SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA com RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA - ampliado";
"06 07 2B 24 08 05 01 02 02"		= "DSA com RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificado";
"06 05 2B 24 08 06 02"				= "Referência de certificado";
"06 05 2B 24 08 06 03"				= "Certificado de atributos";
"06 05 2B 24 08 06 04"				= "Referência de atributos";
"06 05 2B 24 08 06 05"				= "Nome do ficheiro";
"06 05 2B 24 08 06 06"				= "Data de armazenamento";
"06 05 2B 24 08 06 07"				= "Tamanho do ficheiro";
"06 05 2B 24 08 06 08"				= "Local";
"06 05 2B 24 08 06 09"				= "Número de assinatura";
"06 05 2B 24 08 06 0A"				= "Autogerado";

"06 05 2B 24 08 07 01"				= "Teletrust - tipos de apresentação";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binário";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Desenhar";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Texto";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Extensão de certificado Thawte";
"06 05 2B 65 01 04 01"				= "Extranet sólida";

/* X.520 */

"06 02 55 04"		= "Tipos de atributo X.520";
"06 03 55 04 00"	= "Classe de objecto";
"06 03 55 04 01"	= "Entrada com alias";
"06 03 55 04 02"	= "Informação";
"06 03 55 04 03"	= "Nome comum";
"06 03 55 04 04"	= "Apelido";
"06 03 55 04 05"	= "Número de série";
"06 03 55 04 06"	= "País";
"06 03 55 04 07"	= "Localidade";
"06 04 55 04 07 01"	= "Localidade colectiva";
"06 03 55 04 08"	= "Distrito ou região";
"06 04 55 04 08 01"	= "Estado colectivo ou nome da região";
"06 03 55 04 09"	= "Morada";
"06 04 55 04 09 01"	= "Morada colectiva";
"06 03 55 04 0A"	= "Organização";
"06 04 55 04 0A 01"	= "Organização colectiva";
"06 03 55 04 0B"	= "Unidade organizacional";
"06 04 55 04 0B 01"	= "Unidade organizacional colectiva";
"06 03 55 04 0C"	= "Título";
"06 03 55 04 0D"	= "Descrição";
"06 03 55 04 0E"	= "Manual de pesquisa";
"06 03 55 04 0F"	= "Categoria de negócios";
"06 03 55 04 10"	= "Endereço postal";
"06 04 55 04 10 01"	= "Endereço postal colectivo";
"06 03 55 04 11"	= "Código postal";
"06 04 55 04 11 01"	= "Código postal colectivo";
"06 03 55 04 12"	= "Caixa postal";
"06 04 55 04 12 01"	= "Caixa postal colectiva";
"06 03 55 04 13"	= "Escritório para entrega física";
"06 04 55 04 13 01"	= "Escritório para entrega física colectivo";
"06 03 55 04 14"	= "Número de telefone";
"06 04 55 04 14 01"	= "Número de telefone colectivo";
"06 03 55 04 15"	= "Telex";
"06 04 55 04 15 01"	= "Número de teletex colectivo";
"06 03 55 04 16"	= "Teletex - identificador de terminal";
"06 04 55 04 16 01"	= "Identificador de terminal de teletex colectivo";
"06 03 55 04 17"	= "Número de fax";
"06 04 55 04 17 01"	= "Número de fax colectivo";
"06 03 55 04 18"	= "Endereço X.121";
"06 03 55 04 19"	= "Número de ISDN internacional";
"06 04 55 04 19 01"	= "Número de ISDN internacional colectivo";
"06 03 55 04 1A"	= "Endereço registado";
"06 03 55 04 1B"	= "Indicador de destino";
"06 03 55 04 1C"	= "Método de entrega preferido";
"06 03 55 04 1D"	= "Endereço de apresentação";
"06 03 55 04 1E"	= "Contexto de aplicação suportada";
"06 03 55 04 1F"	= "Aderente";
"06 03 55 04 20"	= "Proprietário";
"06 03 55 04 21"	= "Ocupante do cargo";
"06 03 55 04 22"	= "Consultar igualmente";
"06 03 55 04 23"	= "Palavra-passe do utilizador";
"06 03 55 04 24"	= "Certificado de utilizador";
"06 03 55 04 25"	= "Certificado de CA";
"06 03 55 04 26"	= "Lista de revogação da autoridade emissora";
"06 03 55 04 27"	= "Lista de revogação de certificados";
"06 03 55 04 28"	= "Par de certificados cruzados";
"06 03 55 04 29"	= "Nome";
"06 03 55 04 2A"	= "Nome próprio";
"06 03 55 04 2B"	= "Iniciais";
"06 03 55 04 2C"	= "Qualificador de geração";
"06 03 55 04 2D"	= "Identificador único";
"06 03 55 04 2E"	= "Qualificador DN";
"06 03 55 04 2F"	= "Manual de pesquisa melhorado";
"06 03 55 04 30"	= "Informação de protocolo";
"06 03 55 04 31"	= "Nome distinto";
"06 03 55 04 32"	= "Membro único";
"06 03 55 04 33"	= "Identificador de casa";
"06 03 55 04 34"	= "Algoritmos suportados";
"06 03 55 04 35"	= "Lista de revogação delta";
"06 03 55 04 36"	= "Autorização";
"06 03 55 04 3A"	= "Par de certificados cruzados";

/* X.500 object classes */

"06 02 55 06"		= "Classe de objecto X.520";
"06 03 55 06 00"	= "Superior";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "País";
"06 03 55 06 03"	= "Localidade";
"06 03 55 06 04"	= "Organização";
"06 03 55 06 05"	= "Unidade organizacional";
"06 03 55 06 06"	= "Pessoa";
"06 03 55 06 07"	= "Pessoa organizacional";
"06 03 55 06 08"	= "Papel organizacional";
"06 03 55 06 09"	= "Grupo de nomes";
"06 03 55 06 0A"	= "Pessoa domiciliária";
"06 03 55 06 0B"	= "Processo de inscrição";
"06 03 55 06 0C"	= "Entidade de inscrição";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Dispositivo";
"06 03 55 06 0F"	= "Utilizador com autenticação sólida";
"06 03 55 06 10"	= "Autoridade de certificação";
"06 03 55 06 11"	= "Grupo de nomes únicos";
"06 03 55 06 15"	= "PKI - utilizador";
"06 03 55 06 16"	= "PKI - CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmos X.500";
"06 03 55 08 01"	= "Algoritmos de codificação X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Extensões de certificados X.509";
"06 03 55 1D 01"	= "Identificador de chave da autoridade emissora (antigo)";
"06 03 55 1D 02"	= "Atributos de chave principal (antigo)";
"06 03 55 1D 03"	= "Políticas de certificado (antigo)";
"06 03 55 1D 04"	= "Restrição de utilização de chaves (antigo)";
"06 03 55 1D 05"	= "Mapeamentos de política (antigo)";
"06 03 55 1D 06"	= "Restrição de sub-árvore";
"06 03 55 1D 07"	= "Nome alternativo do sujeito (antigo)";
"06 03 55 1D 08"	= "Nome alternativo do emissor (antigo)";
"06 03 55 1D 09"	= "Atributos de directório do sujeito";
"06 03 55 1D 0A"	= "Restrições básicas (antigo 2.5.29.10)";
"06 03 55 1D 0B"	= "Restrições de nomenclatura (antigo)";
"06 03 55 1D 0C"	= "Restrições de política (antigo)";
"06 03 55 1D 0D"	= "Restrições básicas (antigo 2.5.29.13)";
"06 03 55 1D 0E"	= "Identificador de chave do sujeito";
"06 03 55 1D 0F"	= "Utilização de chaves";
"06 03 55 1D 10"	= "Período de utilização de chave privada";
"06 03 55 1D 11"	= "Nome alternativo do sujeito";
"06 03 55 1D 12"	= "Nome alternativo do emissor";
"06 03 55 1D 13"	= "Restrições básicas";
"06 03 55 1D 14"	= "Número da lista de revogação de certificados";
"06 03 55 1D 15"	= "Código de razão de CRL";
"06 03 55 1D 16"	= "Data de validade (antigo)";
"06 03 55 1D 17"	= "Código de instrução de suspensão";
"06 03 55 1D 18"	= "Data de validade";
"06 03 55 1D 19"	= "Pontos de distribuição de CRL (antigo)";
"06 03 55 1D 1A"	= "Ponto de distribuição de emissão (antigo)";
"06 03 55 1D 1B"	= "Indicador delta de CRL";
"06 03 55 1D 1C"	= "Ponto de distribuição de emissão";
"06 03 55 1D 1D"	= "Emissor do certificado";
"06 03 55 1D 1E"	= "Restrições de nomenclatura";
"06 03 55 1D 1F"	= "Pontos de distribuição de CRL";
"06 03 55 1D 20"	= "Políticas de certificado";
"06 04 55 1D 20 00"	= "Qualquer identificador de política";
"06 03 55 1D 21"	= "Mapeamentos de política";
"06 03 55 1D 22"	= "Restrições de política";
"06 03 55 1D 23"	= "Identificador de chave da autoridade emissora";
"06 03 55 1D 24"	= "Restrições de política";
"06 03 55 1D 25"	= "Utilização de chave ampliada";
"06 04 55 1D 25 00"	= "Qualquer utilização da chave ampliada";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS - algoritmo de assinatura";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza - algoritmo de assinatura";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS - algoritmo de confidencialidade";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza - algoritmo de confidencialidade";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS - algoritmo de integridade";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza - algoritmo de integridade";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS - algoritmo de protecção de token";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza - algoritmo de protecção de token";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS - algoritmo de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza - algoritmo de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS - algoritmo de assinatura e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza - algoritmo de assinatura e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A - algoritmo de assinatura";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A - algoritmo de confidencialidade";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A - algoritmo de integridade";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A - algoritmo de protecção de token";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A - algoritmo de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A - algoritmo de assinatura e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza - algoritmo de assinatura actualizada";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza - algoritmos de assinaturas actualizadas e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza - algoritmo de integridade actualizado";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritmos de intercâmbio de chaves";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza - algoritmo Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritmo de cifragem de chave (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 - formato de mensagem";
"06 09 60 86 48 01 65 02 01 02 02"	= "Sem conteúdo";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP - tipo de conteúdo";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 - tipo de conteúdo";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP - tipo de conteúdo";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP - protocolo de agente de repetição de chave";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 - tipo de conteúdo";
"06 09 60 86 48 01 65 02 01 02 48"	= "Corpo de mensagem MSP reencaminhada";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP - parâmetros de mensagens reencaminhadas";
"06 09 60 86 48 01 65 02 01 02 50"	= "Corpo de mensagem CSP reencaminhada";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP - parâmetros de mensagens reencaminhadas";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS - política de segurança";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS - PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "PRBAC - mosaico";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Política de segurança";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Genérico";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Política de segurança predefinida";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS - certificado de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS - certificado de assinatura de utilizador";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS - certificado de assinatura e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza - certificado de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza - certificado de assinatura e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza - certificado de assinatura de utilizador";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza - certificado de assinatura de CA";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS - certificado de assinatura de CA";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vector auxiliar";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Política de recibos";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Adesão";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administradores";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS - CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS - CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS - CKL de assinatura";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS - CKL de assinatura";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS - lista de revogação de certificados (CRL)";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza - lista de revogação de certificados (CRL)";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza - CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Processador de endereços isentos";
"06 09 60 86 48 01 65 02 01 05 30"	= "Protecção";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritmos suportados";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A - certificado de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A - certificado de assinatura e de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A - certificado de assinatura de utilizador";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC - informação";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC - restrições de CA";
"06 09 60 86 48 01 65 02 01 05 37"	= "Privilégios de assinatura ou de gestão de chaves";
"06 09 60 86 48 01 65 02 01 05 38"	= "Privilégios de comunicação";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atributo com etiqueta";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Ficheiro de informação de política";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Ficheiro de informação de política de segurança";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Restrição de autorização de CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Extensões CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI - categorias de segurança";
"06 09 60 86 48 01 65 02 01 08 02"		= "Privilégios de etiqueta de segurança padrão";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Privilégios de assinatura";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Privilégios de gestão de chaves";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Privilégio definido para etiqueta";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Classe 2 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Classe 4 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Classe 3 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Classe 5 do Departamento de Defesa dos EUA";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Classe 3 da ICP do Departamento de Defesa dos EUA";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Política de segurança de teste";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 - categorias de segurança";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 - conjunto de etiquetas zero";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 - conjunto de etiquetas um";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 - conjunto de etiquetas dois";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 - categorias de segurança";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 - conjunto de etiquetas zero";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 - conjunto de etiquetas um";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 - conjunto de etiquetas dois";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka - categorias de segurança";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka - nome de conjunto de etiquetas 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka - nome de conjunto de etiquetas 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka - nome de conjunto de etiquetas 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Entrada-teste de CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etiqueta";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK - identificador de política";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA - identificador de política rudimentar";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA - identificador de política básico";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA - identificador de política médio";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA - identificador de política avançado";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Chave KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Extensões";
"06 09 60 86 48 01 65 03 02 03 01"		= "Técnica de recuperação de chaves";
"06 09 60 86 48 01 65 03 02 03 02"		= "Capaz de recuperação de chave";
"06 09 60 86 48 01 65 03 02 03 03"		= "Recuperação de chaves";
"06 08 60 86 48 01 65 03 02 04"			= "Esquemas de recuperação de chaves";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR - extensão GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST - algoritmo";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell - algoritmo";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "IV8 de teclado DES-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "IV8 de teclado DES-EDE2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "IV8 de teclado DES-EDE3-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Teclado RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 com cifragem RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 com cifragem RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 com cifragem RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM - síntese";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC com SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC com MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Teclado RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 - pacote";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Cifragem RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Palavra-passe NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI - tipo de atributos";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atributos de segurança";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Limite de confiança";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape - identificador de objecto";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape - extensão do certificado";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape - tipo de certificado";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape Base URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape - URL de revogação";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape - URL de revogação de CA";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape - URL de descarga de CRL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape - URL de descarga de certificado de CA";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape - URL de renovação de certificado";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape - URL de política de CA";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape - URL da página inicial do certificado";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape - logótipo da entidade do certificado";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape - imagem do utilizador do certificado";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape - nome do servidor SSL";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape - comentário de certificado";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape - tipo de dados";
"06 09 60 86 48 01 86 F8 42 02 01"	= "imagem/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "imagem/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "texto/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape - sequência de certificado ";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape - URL de certificado";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape - identificador de objecto de lista";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definições LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Licença automóvel";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Número de departamento";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Número de empregado";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Tipo de empregado";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Pessoa organizacional na Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign - CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign - InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Extensão Verisign de VPN desconhecida";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Extensão Verisign de VPN desconhecida";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign - identificador de política";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign - aviso CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign - CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign - CA de SGC";

/* SET */

"06 03 67 2A 00"	= "Tipo de conteúdo";
"06 04 67 2A 00 00"	= "Dados PAN";
"06 04 67 2A 00 01"	= "Token PAN";
"06 04 67 2A 00 02"	= "Só PAN";

"06 03 67 2A 01"	= "Extensão de mensagem";
"06 03 67 2A 02"	= "Campo";
"06 04 67 2A 02 00"	= "Nome completo";
"06 04 67 2A 02 01"	= "Nome próprio";
"06 04 67 2A 02 02"	= "Apelido";
"06 04 67 2A 02 03"	= "Apelido de nascimento";
"06 04 67 2A 02 04"	= "Local";
"06 04 67 2A 02 05"	= "Número de identificação";
"06 04 67 2A 02 06"	= "Mês";
"06 04 67 2A 02 07"	= "Dados";
"06 04 67 2A 02 08"	= "Endereço";
"06 04 67 2A 02 09"	= "Telefone";
"06 04 67 2A 02 0A"	= "Quantia";
"06 04 67 2A 02 0B"	= "Número de conta";
"06 04 67 2A 02 0C"	= "Frase-passe";

"06 03 67 2A 03"		= "Atributo";
"06 04 67 2A 03 00"		= "Certificado";
"06 05 67 2A 03 00 00"	= "Impressão digital da chave raiz";
"06 05 67 2A 03 00 01"	= "Política adicional";

"06 03 67 2A 04"	= "Algoritmo";
"06 03 67 2A 05"	= "Política";
"06 04 67 2A 05 00"	= "Root";
"06 03 67 2A 06"	= "Módulo";
"06 03 67 2A 07"	= "Extensão de certificado";
"06 04 67 2A 07 00"	= "Chave de raiz com hash";
"06 04 67 2A 07 01"	= "Tipo de certificado";
"06 04 67 2A 07 02"	= "Dados comerciais";
"06 04 67 2A 07 03"	= "Certificado de cartão requerido";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "SET - extensões";
"06 04 67 2A 07 06"	= "SET - qualificador";

"06 03 67 2A 08"	= "Marca";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Distribuidor";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Nacional";
"06 05 67 2A 0A E2 00"	= "Japão";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Chave de raiz com hash";
"06 04 86 8D 6F 03"	= "Tipo de certificado";
"06 04 86 8D 6F 04"	= "Dados comerciais";
"06 04 86 8D 6F 05"	= "Certificado de cartão requerido";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "SET - qualificador";
"06 04 86 8D 6F 63"	= "SET - dados";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple - segurança de dados";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple - identificador de política de confiança";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple - política de iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple - política de base para X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple - política de SSL";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple - política de geração de certificados locais";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple - política de geração de CSR local";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple - política de revogação de CRL";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple - política de revogação de OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple - política de S/MIME";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple - política de autenticação extensível";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple - política de assinatura de actualizações de software";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple - política de IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple - política do iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple - política de assinatura de recursos";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple - política de assinatura de clientes Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple - política de assinatura de servidores Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple - política de assinatura de código";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple - política de assinatura de pacotes";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple - identificador de algoritmos de segurança";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Cifragem elíptica rápida (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple - compressão segura (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE com assinatura MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE com assinatura SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple - cifragem FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple - FEED (experimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE com assinatura ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple  - identificador de certificados .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple - pedido de certificação .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple - pedido de certificação de identidade .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple - pedido de certificação para assinatura de e-mail .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple - pedido de certificação para codificação de e-mail .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple - pedido de lista de arquivos .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple - pedido de armazenamento de arquivos .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple - pedido de recuperação de arquivos .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple - pedido de eliminação de arquivos .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple - extensão de certificados .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple - identidade .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple - assinatura de e-mail .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple - codificação de e-mail .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple - valor de pedido de certificação .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Utilizador";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Palavra-passe";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nome do host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Renovar indicador";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Indicador assíncrono";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple - utilização de chave ampliada";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple - assinatura de código";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple - assinatura de código (programação)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple - assinatura de actualizações de software";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple - assinatura de código (reservada)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple - assinatura de recursos";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple - assinatura iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple - cifragem do iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple - identidade do sistema";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple - políticas de certificação";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple - política de certificação";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple - política de certificação .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Assinatura de código";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel - segurança de CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel - formatos de segurança de CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Extensões de certificados X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Extensões de certificados privados X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Mapa de bits da assinatura do sujeito";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Imagem do sujeito";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Endereço de e-mail do sujeito";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Usar isenções";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel - algoritmos de segurança de CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 com ECDSA";

/* end */
